
Функция PingPing(Запрос)
	Возврат ОбщегоНазначенияHTTP.ПростойУспешныйОтвет();
КонецФункции

Функция SendPostSend(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачалоЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
	
	Попытка
		Ответ = ОбщегоНазначенияHTTP.ПростойУспешныйОтвет();
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		Ответ = ОбщегоНазначенияHTTP.ОтветОбОшибке(ИнформацияОбОшибке);
	КонецПопытки;
	
	ОценкаПроизводительности.ЗакончитьЗамерВремениТехнологический("Bots.send", НачалоЗамера);
	
	ОбщегоНазначенияHTTP.ЗаписьЛога("send", Запрос, Ответ);
	
	Возврат Ответ;

КонецФункции
